# Данная сеть способна сложить 2+2 или другие небольшие значения
w0 = 0.9907079
w1 = 1.0264927
w2 = 0.01417504
w3 = -0.8950311
w4 = 0.88046944
w5 = 0.7524377
w6 = 0.794296
w7 = 1.1687347
w8 = 0.2406884

b0 = -0.00076612
b1 = -0.06846002
b2 = -0.00055442
b3 = -0.00000929


def relu(x):
    return max(0, x)


def predict(x1, x2):
    h1 = (x1 * w0) + (x2 * w1) + b0
    h2 = (x1 * w2) + (x2 * w3) + b1
    h3 = (x1 * w4) + (x2 * w5) + b2

    y = (relu(h1) * w6) + (relu(h2) * w7) + (relu(h3) * w8) + b3
    return y


print(predict(2, 2))
print(predict(1.5, 1.5))
print(predict(1.5, 15))
print(predict(-10, -15))